<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports the latest version of Dialpad into munki</string>
	<key>Identifier</key>
	<string>com.github.rickheil.psautopkg.munki.Dialpad</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Dialpad</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
            <string>With Dialpad Everywhere, your business phone system now follows your workflows, not the other way around. Whether you’re placing a call or receiving one, Dialpad Everywhere is always on top of whatever browser, app, or window you’re viewing.</string>
			<key>display_name</key>
			<string>Dialpad</string>
			<key>developer</key>
			<string>Dialpad</string>
			<key>name</key>
			<string>%NAME%</string>
		 	<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
			<array>
				<string>Dialpad</string>
			</array>
		</dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.mikestechshop.pkg.Dialpad</string>
    <key>MinimumVersion</key>
    <string>1.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
                <string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
