<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for Graylog&apos;s collector software.</string>
	<key>Identifier</key>
	<string>com.github.rickheil.psautopkg.download.graylog-collector</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>graylogcollector</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/Graylog2/collector</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;https://packages.graylog2.org/releases/graylog-collector/graylog-collector-[0-9\.]+.tgz)</string>
			</dict>
			<key>Processor</key>
			<string>CURLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.tgz</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>