<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Brackets and imports into a Munki repo.</string>
    <key>Identifier</key>
    <string>com.github.rickheil.psautopkg.munki.Brackets</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Brackets</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Brackets is an open source code editor for web designers and front-end developers. Supported by Adobe.</string>
            <key>display_name</key>
            <string>Brackets</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rickheil.psautopkg.download.Brackets</string>
    <key>Process</key>
    <array>
    	<dict>
        	<key>Processor</key>
        	<string>AppDmgVersioner</string>
        	<key>Arguments</key>
        		<dict>
        		<key>dmg_path</key>
        		<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
        		</dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
