<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Description</key>
        <string>Imports the latest version of OpenJDK11 into munki</string>
        <key>Identifier</key>
        <string>com.github.rickheil.psautopkg.munki.OpenJDK11</string>
        <key>Input</key>
        <dict>
		<key>NAME</key>
		<string>OpenJDK11</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>OpenJDK is a free and open-source implementation of the Java Platform, Standard Edition, and the official reference implementation of Java SE since version 7.</string>
			<key>display_name</key>
			<string>OpenJDK 11</string>
			<key>developer</key>
			<string>Open Source</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.OpenJDK11</string>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>pkg_path</key>
                                <string>%RECIPE_CACHE_DIR%/%VENDOR%-%version%.pkg</string>
                                <key>repo_subdirectory</key>
                                <string>%MUNKI_REPO_SUBDIR%</string>
                        </dict>
                        <key>Processor</key>
                        <string>MunkiImporter</string>
                </dict>
	</array>
</dict>
</plist>
