<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports the latest version of 8x8 Virtual Office Desktop into munki</string>
	<key>Identifier</key>
	<string>com.github.rickheil.psautopkg.munki.8x8VirtualOffice</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>8x8VirtualOfficeDesktop</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Virtual Office Desktop is a comprehensive unified communications application that integrates a business softphone with visual voicemail, corporate directory, instant messaging, presence, video calling, fax, call recording, web conferencing, and social media.</string>
			<key>display_name</key>
			<string>8x8 Virtual Office</string>
			<key>developer</key>
			<string>8x8</string>
			<key>name</key>
			<string>%NAME%</string>
		 	<key>unattended_install</key>
			<true/>
			<key>blocking_applications</key>
			<array>
				<string>8x8 - Virtual Office</string>
			</array>
			<key>minimum_os_version</key>
			<string>10.10</string>
		</dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.rickheil.psautopkg.download.8x8VirtualOffice</string>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
                <string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
