<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>description</key>
	<string>Downloads the Mister Horse Animation Composer AfterEffects plugin installer app</string>
	<key>Identifier</key>
	<string>com.github.rickheil.psautopkg.download.AnimationComposer</string>
	<key>MinimumVersion</key>
	<string>0.2.3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AnimationComposer</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
                <string>https://misterhorse.tv/downloads/get?id=1&amp;os=osx</string>
                <key>filename</key>
                <string>Mister Horse Animation Composer.zip</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
