<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports the latest version of Universal Type Client to a munki repo.</string>
    <key>Identifier</key>
    <string>com.github.rickheil.psautopkg.munki.UniversalTypeClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Universal Type Client</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>description</key>
            <string>Keeping your creative team productive, inspired, and on task is paramount. It shouldn't be an overwhelming task. Centralize your font collection, banish font issues and protect your team from licensing concenrs with Universal Type Server and Client.</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.rickheil.psautopkg.pkg.UniversalTypeClient</string>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>file://%found_filename%</string>
                <key>re_pattern</key>
                <string>[0-9.]{5}</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>installs_item_paths</key>
                <string>%found_filename%</string>
            </dict>
        </dict> 
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%found_filename%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>