<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Zscaler. Set INCLUDE_LIMITED to True to include limited availability releases.</string>
        <key>Identifier</key>
        <string>com.github.rickheil-recipes.download.Zscaler</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Zscaler</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>ZscalerURLProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>include_limited</key>
                    <string>%INCLUDE_LIMITED%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>