<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Zscaler and imports it into Munki.</string>
        <key>Identifier</key>
        <string>com.github.rickheil-recipes.munki.Zscaler</string>
        <key>Input</key>
        <dict>
            <key>INCLUDE_LIMITED</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps</string>
            <key>NAME</key>
            <string>Zscaler</string>
            <key>STRICT_ENFORCEMENT</key>
            <string></string>
            <key>POLICY_TOKEN</key>
            <string></string>
            <key>CLOUD_NAME</key>
            <string></string>
            <key>MODE</key>
            <string></string>
            <key>UNATT_MODE_UI</key>
            <string></string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Zscaler enables Zero Trust workflows and lets you use the internet as your corporate network.</string>
                <key>developer</key>
                <string>Zscaler</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>uninstall_method</key>
                <string>uninstall_script</string>
                <key>uninstall_script</key>
                <string>!/bin/bash
/Applications/Zscaler/.Uninstaller.sh
/usr/sbin/pkgutil --forget=com.zscaler.zscaler.pkg
                </string>
                <key>unattended_install</key>
                <false/>
                <key>postinstall_script</key>
                <string>#!/bin/bash
/tmp/%app-name%/Contents/MacOS/installbuilder.sh \
  --strictEnforcement '%STRICT_ENFORCEMENT%' \
  --policyToken '%POLICY_TOKEN%' \
  --cloudName '%CLOUD_NAME%' \
  --mode '%MODE%' \
  --unattendedmodeui '%UNATT_MODE_UI%'</string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rickheil-recipes.pkg.Zscaler</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/Zscaler*.app</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%found_filename%/Contents/Info.plist</string>
                   <key>plist_version_key</key>
                   <string>CFBundleShortVersionString</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>installs</key>
                            <array>
                                <dict>
                                    <key>CFBundleIdentifier</key>
                                    <string>com.zscaler.Zscaler</string>
                                    <key>CFBundleName</key>
									<string>Zscaler</string>
									<key>CFBundleShortVersionString</key>
									<string>%version%</string>
									<key>CFBundleVersion</key>
									<string>%version%</string>
									<key>path</key>
									<string>/Applications/Zscaler/Zscaler.app</string>
									<key>type</key>
									<string>application</string>
									<key>version_comparison_key</key>
									<string>CFBundleShortVersionString</string>
                    			</dict>
                			</array>
                		<key>items_to_copy</key>
                		<array>
                    		<dict>
                        		<key>destination_path</key>
                        		<string>/tmp</string>
                        		<key>source_item</key>
                        		<string>Zscaler-osx-%version%-installer.app</string>
                    		</dict>
                		</array>
                	</dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/Zscaler_osx.dmg</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>