<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Zscaler .pkg installer and imports it into Munki. Set VERSION_PREFIX to e.g. '4.5' to pin to an LTS branch.</string>
        <key>Identifier</key>
        <string>com.github.rickheil-recipes.munki.ZscalerPkg</string>
        <key>Input</key>
        <dict>
            <key>INCLUDE_LIMITED</key>
            <string></string>
            <key>DOWNLOAD_TYPE</key>
            <string>pkg</string>
            <key>VERSION_PREFIX</key>
            <string></string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps</string>
            <key>NAME</key>
            <string>Zscaler</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Zscaler enables Zero Trust workflows and lets you use the internet as your corporate network.</string>
                <key>developer</key>
                <string>Zscaler</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>uninstall_method</key>
                <string>uninstall_script</string>
                <key>uninstall_script</key>
                <string>#!/bin/bash -p
/Applications/Zscaler/.Uninstaller.sh
/usr/sbin/pkgutil --forget=com.zscaler.zscaler.pkg
                </string>
                <key>unattended_install</key>
                <false/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rickheil-recipes.download.Zscaler</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>blocking_applications</key>
                        <array/>
                        <key>installs</key>
                        <array>
                            <dict>
                                <key>CFBundleIdentifier</key>
                                <string>com.zscaler.Zscaler</string>
                                <key>CFBundleName</key>
                                <string>Zscaler</string>
                                <key>CFBundleShortVersionString</key>
                                <string>%version%</string>
                                <key>CFBundleVersion</key>
                                <string>%version%</string>
                                <key>path</key>
                                <string>/Applications/Zscaler/Zscaler.app</string>
                                <key>type</key>
                                <string>application</string>
                                <key>version_comparison_key</key>
                                <string>CFBundleShortVersionString</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
