<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Microsoft Outlook and imports into a Munki repo.</string>
    <key>Identifier</key>
    <string>com.github.rickheil.psautopkg.munki.MicrosoftExce365</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Microsoft Outlook 365</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>&lt;html&gt;&lt;p style=&quot;font-family:Helvetica;font-size:12px&quot;&gt;For detailed information about this update, please visit the following Web site: &lt;/p&gt;

&lt;p style=&quot;font-family:Helvetica;font-size:12px&quot;&gt;&lt;a href=&quot;https://go.microsoft.com/fwlink/?LinkID=831049&quot; target=&quot;_blank&quot;&gt;https://go.microsoft.com/fwlink/?LinkID=831049&lt;/a&gt;&lt;/p&gt;&lt;/html&gt;</string>
            <key>blocking_applications</key>
            <array>
                <string>Microsoft Outlook</string>
                <string>Microsoft Error Reporting</string>
                <string>Microsoft Auto Update</string>
            </array>
            <key>display_name</key>
            <string>Microsoft Outlook 365 for Mac</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.microsoftoutlook365</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
