<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Windows App (formerly Microsoft Remote Desktop) and imports into a Munki repo.</string>
    <key>Identifier</key>
    <string>com.github.rickheil.WindowsAppDDL.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Windows App</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Microsoft/Windows App</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Use the Windows App (formerly Microsoft Remote Desktop) to connect to a remote PC or virtual apps and desktops made available by your administrator. The app helps you be productive no matter where you are.</string>
            <key>developer</key>
            <string>Microsoft</string>
            <key>display_name</key>
            <string>Windows App</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.microsoftwindowsapp</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
