<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>description</key>
	<string>Downloads the Astute Graphics DrawBundle AfterEffects bundle installer</string>
	<key>Identifier</key>
	<string>com.github.rickheil.psautopkg.download.DrawBundle</string>
	<key>MinimumVersion</key>
	<string>0.2.3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DrawBundle</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
                <string>https://astutegraphics.com/downloads/astute-graphics-unified-installer-mac.dmg</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
