<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Tower and imports into a Munki repo.</string>
    <key>Identifier</key>
    <string>com.github.rickheil.psautopkg.munki.Tower</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Tower</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Git Tower is a powerful Git client for Mac users who want to access their repositories using an easy-to-use and intuitive graphical interface.</string>
            <key>display_name</key>
            <string>Tower</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rickheil.psautopkg.download.Tower</string>
    <key>Process</key>
    <array>
        <dict>
        	<key>Processor</key>
        	<string>Unarchiver</string>
        	<key>arguments</key>
        	<dict>
        		<key>archive_format</key>
        		<string>zip</string>
        		<key>archive_path</key>
        		<string>%pathname%</string>
        		<key>destination_path</key>
        		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
        		<key>purge_destination</key>
        		<true/>
        	</dict>
        	
        	<key>Processor</key>
        	<string>DmgCreator</string>
        	<key>arguments</key>
        	<dict>
        		<key>dmg_root</key>
        		<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>dmg_path</key>
        		<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
        	</dict>
        	        	<key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
           	<key>Processor</key>
            <string>MunkiImporter</string>

        </dict>
    </array>
</dict>
</plist>
