<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the FitBit Connect app for use in autopkg.</string>
	<key>Identifier</key>
	<string>com.github.rickheil.psautopkg.download.FitBitConnect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Fitbit Connect</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.5</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.Fitbit</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.mpkg</string>
				<key>source_pkg</key>
				<string>%pathname%/Install Fitbit Connect.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
